'''
1. დაწერეთ პითონის პროგრამა, რომელიც ცვლის tuple-ის ბოლო მნიშვნელობას სიაში.

ნიმუშების სია: [(10, 20, 40), (40, 50, 60), (70, 80, 90)]

'''
#
# x = [(10, 20, 40), (40, 50, 60), (70, 80, 90)]
# x[-1] = (100, 110, 120)
#
# print(x)


'''
2.max და min ფუნქციის გარეშე იპოვეთ სეტში არსებული უმცირესი და უდიდესი მონაცემი.

'''
#
# my_set = {4, 8, 6, 1, 78, 26}
# my_tuple = tuple(my_set)
# min_numbrt = my_tuple[0]
# max_numbrt = my_tuple[-1]
#
# print(min_numbrt, max_numbrt)


'''
3.დაწერეთ პითონის პროგრამა, რათა გამოვთვალოთ რიცხვების საშუალო მნიშვნელობა მოცემულ ტოპებში.

Input = ((10, 10, 10, 12), (30, 45, 56, 45), (81, 80, 39, 32), (1, 2, 3, 4))


'''

Input = ((10, 10, 10, 12), (30, 45, 56, 45), (81, 80, 39, 32), (1, 2, 3, 4))

Output = []
for i in Input:
    Output.append(sum(i)/len(i))

print(Output)